# ukol-08: Adopce zvířat


Úkol můžeš odevzdat buďto jako Jupyter Notebook .ipynb, nebo jako klasický program .py.

Stáhni si dataset, který obsahuje seznam zvířat k adopci v ZOO Praha. Zdroj dat je Národní katalog otevřených dat.

Data si načti pomocí metody pandas.read_csv(). Pozor, nastav oddělovač na znak středníku. Využij parametr sep.

Seznam se s daty. Kolik má tabulka řádek a sloupců? Jak se sloupce jmenují?

Které zvíře se nachází na záznamu s indexem 34? Vypiš název tohoto zvířete v češtině a v angličtině.

In [3]:
import pandas
zvirata = pandas.read_csv("adopce-zvirat.csv", sep=";")

Počet řádků a sloupců

In [6]:
zvirata.shape

(513, 6)

Názvy sloupců

In [5]:
zvirata.columns

Index(['id', 'nazev_cz', 'nazev_en', 'trida_cz', 'cena', 'k_prohlidce'], dtype='object')

Zvíře s indexem 34 v češtině a angličtině.

In [12]:
zvirata.iloc[34]["nazev_cz"]

'Ibis bílý'

In [13]:
zvirata.iloc[34]["nazev_en"]

'White ibis'

# Nepovinný bonus

Využij metody sort_values() (a libovolných dalších metod), ke zjištění následujících informací:

Adopce kterých zvířat je nejdražší?
Které zvíře je alfabeticky poslední v češtině? Které v angličtině?
Bonus můžeš doplnit o nějaké vlastní pozorování.

In [16]:
zvirata.sort_values("cena").tail(10)

,id,nazev_cz,nazev_en,trida_cz,cena,k_prohlidce
115,336,Lev indický,Asiatic lion,Savci,30000,1
105,310,Medvěd lední,Polar bear,Savci,30000,1
102,298,Gorila nížinná,Western lowland gorilla,Savci,30000,1
244,776,Varan komodský,Komodo dragon,Plazi,30000,1
114,335,Tygr sumaterský,Sumatran tiger,Savci,50000,1
113,334,Tygr ussurijský,Siberian tiger,Savci,50000,1
272,897,Tygr malajský,Malayan tiger,Savci,50000,1
129,385,Hroch obojživelný,Hippopotamus,Savci,50000,1
135,396,Žirafa severní núbijská (= Rothschildova),Rothschild's giraffe,Savci,50000,1
128,381,Slon indický,Asian elephant,Savci,50000,1

ID šesti nejdrazších zvířat (cena 50 000): 335,334,897,385,396,381.

Alfabeticky poslední zvíře v češtině:

In [17]:
zvirata.sort_values("nazev_cz").tail(1)

       id     nazev_cz                nazev_en trida_cz  cena  k_prohlidce
371  1190  Žluva hajní  Eurasian golden oriole    Ptáci  1000            1

Alfabeticky poslední zvíře v angličtině:

In [18]:
zvirata.sort_values("nazev_en").tail(1)

,id,nazev_cz,nazev_en,trida_cz,cena,k_prohlidce
161,491,Frankolín žlutokrký,Yellow-necked francolin,Ptáci,1000,1